In [2]:
import sqlite3

In [3]:
%load_ext sql

In [4]:
%sql postgresql://robot-startml-ro:pheiph0hahj1Vaif@postgres.lab.karpov.courses:6432/startml

Задание 1
Сделайте запрос на все колонки из таблицы user. Для этого может понадобиться взять user в кавычки, вот так: "user" - чтобы PostgreSQL не спутал ее со своей встроенной таблицей user, где он ведет учет всех пользователей.

Напишите через пробел, с какого id начинаются записи и какой город у самого первого ID (на английском)

In [24]:
%%sql

SELECT * 
FROM "user"
LIMIT 1

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
1 rows affected.

[(200, 1, 34, 'Russia', 'Degtyarsk', 3, 'Android', 'ads')]

Задание 2
Отберите уникальные значения тем (topic) в таблице постов (post).

Напишите через пробел, сколько их и какой из них имеет самое длинное название.

In [25]:
%%sql

SELECT DISTINCT topic
FROM post

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
7 rows affected.

[('tech',),
 ('covid',),
 ('movie',),
 ('entertainment',),
 ('politics',),
 ('sport',),
 ('business',)]

Задание 3

Отберите пользователей старше 30 с устройством на iOS. Каков ID и город записи с минимальным ID (он идет первым в таблице)? Запишите значения через пробел.

In [26]:
%%sql

SELECT *
FROM "user"
WHERE age > 30 and os = 'iOS'
LIMIT 1

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
1 rows affected.

[(212, 1, 47, 'Russia', 'Podolsk', 0, 'iOS', 'ads')]

Задание 4
Отберите пользователей, которые не из России и при этом либо их экспериментальная группа не лежит в (0, 3) или их город – Минск.

Напишите через пробел первые 4 ID в такой выдаче.

In [27]:
%%sql

SELECT *
FROM "user"
WHERE (country != 'Russia') AND (exp_group NOT IN(0, 3) OR city = 'Minsk')
LIMIT 4

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
4 rows affected.

[(211, 1, 22, 'Belarus', 'Minsk', 0, 'iOS', 'ads'),
 (213, 1, 22, 'Ukraine', 'Kamianske', 2, 'iOS', 'ads'),
 (216, 0, 38, 'Ukraine', 'Lviv', 1, 'Android', 'ads'),
 (218, 1, 25, 'Belarus', 'Minsk', 2, 'iOS', 'ads')]

Задание 5
Подсчитайте средний возраст пользователей в разрезе страны. В ответ напишите средний возраст пользователей из Кипра. Ответ округлите до двух знаков после точки.

In [28]:
%%sql

SELECT ROUND(AVG(age), 2)
FROM "user"
WHERE country = 'Cyprus'

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
1 rows affected.

[(Decimal('28.07'),)]

In [29]:
%%sql

SELECT country, ROUND(AVG(age), 2) 
FROM "user"
GROUP BY country
HAVING country = 'Cyprus'

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
1 rows affected.

[('Cyprus', Decimal('28.07'))]

Задание 6

Сгруппируйте пользователей сначала по экспериментальной группе, а затем по операционной системе. В каждой группе подсчитайте количество пользователей, максимальный и минимальный возраст.

Сохраните результаты в файл CSV колонками exp_group, os, total_users, max_age, min_age (обратите внимание на название последних трех колонок!), используя запятую в качестве сепаратора, и отправьте файл в LMS.

Для сохранения в CSV в Redash внизу есть кнопка "три точки", где выпадает пункт "Download as CSV file".

In [30]:
%%sql

SELECT exp_group, os, COUNT(id), MAX(age), MIN(age) 
FROM "user"
GROUP BY (exp_group, os)

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
10 rows affected.

[(0, 'Android', 21234, 95, 14),
 (0, 'iOS', 11489, 79, 14),
 (1, 'Android', 21232, 92, 14),
 (1, 'iOS', 11406, 87, 14),
 (2, 'Android', 21102, 78, 14),
 (2, 'iOS', 11512, 74, 14),
 (3, 'Android', 21319, 84, 14),
 (3, 'iOS', 11449, 85, 14),
 (4, 'Android', 21085, 84, 14),
 (4, 'iOS', 11377, 78, 14)]

Задание 7

В каждой категории постов определите длину самого длинного текста, используя таблицу post. В ответ отправьте тему, у которой длина самого большого поста равна по порядку 25 000.

In [12]:
%%sql

SELECT * 
FROM post
LIMIT 2

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [13]:
%%sql

SELECT topic, MAX(LENGTH(text))
FROM post
GROUP BY topic

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Задание 8

Найдите страну с наименьшим числом пользователей среди стран, у которых общее число пользователей больше 1000. Введите ее название на английском.

In [14]:
%%sql

SELECT country, COUNT(id)
FROM "user"
GROUP BY country
HAVING COUNT(id) > 1000
ORDER BY COUNT(id)

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Задание 10

Отберите для пользователей из Москвы экспериментальные группы, в которых средний возраст больше 27.2. Напишите через пробел число пользователей в этих группах.

In [15]:
%%sql

SELECT exp_group, COUNT(id)
FROM "user"
WHERE city = 'Moscow'
GROUP BY exp_group
HAVING AVG(age) > 27.2

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Задание 11

Сейчас мы будем работать с другой таблицей под названием post. Найдите в таблице post 3 темы с наибольшим количеством постов. Напишите через пробел названия этих тем.

In [16]:
%%sql

SELECT topic, COUNT(text)
FROM post
GROUP BY topic
ORDER BY COUNT(text) DESC
LIMIT 3

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Задание 12

Отберите пользователей из Воронежа (Voronezh) и отсортируйте их по возрасту в убывающем порядке. Для равных возрастов отсортируйте по возрастанию экспериментальной группы.

Напишите ID второго в порядке выдачи пользователя.

In [17]:
%%sql

SELECT *
FROM "user"
WHERE city = 'Voronezh'
ORDER BY age DESC, exp_group
LIMIT 2

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Задание 13

Отберите post_id, time, age и os пользователя для всех лайков пользователей из Омска. Отсортируйте результаты по убыванию времени действия и загрузите в LMS первые 100 значений в формате CSV (сепаратор "запятая", колонки с теми же названиями, что и в задании).

In [18]:
%%sql

SELECT *
FROM feed_action
LIMIT 5

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [19]:
%%sql

SELECT post_id, time, age, os
FROM feed_action fa
LEFT JOIN "user" u on fa.user_id = u.id
WHERE fa.action = 'like' AND u.city = 'Omsk'
ORDER BY time DESC
LIMIT 100

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Задание 14

Найдите город, пользователи которого в возрасте 36 лет 2021-12-01 числа просмотрели запись на тему covid меньше всего раз относительно других городов. Введите его название на английском.

In [20]:
%%sql

SELECT city, COUNT(action)
FROM feed_action fa
LEFT JOIN "user" u on fa.user_id = u.id LEFT JOIN post p on 
fa.post_id = p.id
WHERE DATE(time) = '2021-12-01' AND p.topic = 'covid' AND u.age = 36
GROUP BY city
ORDER by COUNT(action)
LIMIT 10

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

Задание 15

Напишите SQL запрос, используя который вы получите:
- топ N постов по лайкам,
- количество пролайкавших пользователей,
- время последнего лайка.

В качестве ответа напишите через пробел первые 3 ID постов из этого топа.

Сохраните запрос, он может понадобиться в будущем в финальном проекте.

In [21]:
%%sql

SELECT post_id, COUNT(user_id), MAX(time)
FROM feed_action fa
LEFT JOIN "user" u on fa.user_id = u.id LEFT JOIN post p on 
fa.post_id = p.id
WHERE fa.action = 'like'
GROUP BY post_id
ORDER by COUNT(action) DESC
LIMIT 3

Environment variable $DATABASE_URL not set, and no connect string given.
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [6]:
%%sql

SELECT * FROM feed_action LIMIT 10

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
10 rows affected.

[(114673, 6336, 'view', datetime.datetime(2022, 1, 13, 23, 14, 52)),
 (73450, 6250, 'like', datetime.datetime(2022, 1, 13, 23, 14, 52)),
 (125721, 6315, 'view', datetime.datetime(2022, 1, 13, 23, 14, 52)),
 (137994, 6309, 'view', datetime.datetime(2022, 1, 13, 23, 14, 52)),
 (138683, 6338, 'view', datetime.datetime(2022, 1, 13, 23, 14, 52)),
 (140174, 6174, 'like', datetime.datetime(2022, 1, 13, 23, 14, 52)),
 (94315, 6240, 'view', datetime.datetime(2022, 1, 13, 23, 14, 53)),
 (132666, 5959, 'view', datetime.datetime(2022, 1, 13, 23, 14, 53)),
 (131064, 6336, 'like', datetime.datetime(2022, 1, 13, 23, 14, 53)),
 (115105, 6337, 'view', datetime.datetime(2022, 1, 13, 23, 14, 53))]

In [9]:
%%sql

SELECT user_id, COUNT(action)
FROM feed_action
WHERE action = 'like'
GROUP BY user_id
ORDER BY COUNT(action) DESC
LIMIT 1

 * postgresql://robot-startml-ro:***@postgres.lab.karpov.courses:6432/startml
1 rows affected.

[(108481, 454)]